; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob56) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 depot1)
	(clear crate5)
	(at pallet2 depot2)
	(clear crate3)
	(at pallet3 distributor0)
	(clear crate4)
	(at pallet4 distributor1)
	(clear crate11)
	(at pallet5 distributor2)
	(clear crate12)
	(at pallet6 distributor1)
	(clear crate9)
	(at pallet7 depot2)
	(clear crate13)
	(at truck0 depot1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 449)
	(at truck1 distributor1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 292)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot1)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor2)
	(available hoist9)
	(at hoist10 depot0)
	(available hoist10)
	(at crate0 distributor1)
	(on crate0 pallet4)
	(= (weight crate0) 6)
	(at crate1 depot2)
	(on crate1 pallet2)
	(= (weight crate1) 82)
	(at crate2 distributor0)
	(on crate2 pallet3)
	(= (weight crate2) 79)
	(at crate3 depot2)
	(on crate3 crate1)
	(= (weight crate3) 13)
	(at crate4 distributor0)
	(on crate4 crate2)
	(= (weight crate4) 79)
	(at crate5 depot1)
	(on crate5 pallet1)
	(= (weight crate5) 35)
	(at crate6 distributor1)
	(on crate6 crate0)
	(= (weight crate6) 13)
	(at crate7 depot0)
	(on crate7 pallet0)
	(= (weight crate7) 30)
	(at crate8 distributor1)
	(on crate8 pallet6)
	(= (weight crate8) 99)
	(at crate9 distributor1)
	(on crate9 crate8)
	(= (weight crate9) 56)
	(at crate10 distributor2)
	(on crate10 pallet5)
	(= (weight crate10) 76)
	(at crate11 distributor1)
	(on crate11 crate6)
	(= (weight crate11) 34)
	(at crate12 distributor2)
	(on crate12 crate10)
	(= (weight crate12) 93)
	(at crate13 depot2)
	(on crate13 pallet7)
	(= (weight crate13) 49)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate1 crate10)
		(on crate2 crate4)
		(on crate4 pallet3)
		(on crate5 pallet1)
		(on crate6 pallet4)
		(on crate7 crate9)
		(on crate8 pallet2)
		(on crate9 pallet0)
		(on crate10 pallet5)
		(on crate11 pallet6)
		(on crate12 crate11)
		(on crate13 crate6)
	)
)

(:metric minimize (total-time)))

; plan
1. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 0 to 10
   goals met: 2 of 12
2. (lift hoist10 crate7 pallet0 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist10) (on crate7 pallet0)
   added: (lifting hoist10 crate7) (clear pallet0)
   changed: (fuel-cost) from 10 to 11
   goals met: 2 of 12
3. (load hoist10 crate7 truck0 depot0)
   deleted: (lifting hoist10 crate7)
   added: (in crate7 truck0) (available hoist10)
   changed: (current_load truck0) from 0 to 30
   goals met: 2 of 12
4. (lift hoist8 crate4 crate2 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist8) (on crate4 crate2)
   added: (lifting hoist8 crate4) (clear crate2)
   changed: (fuel-cost) from 11 to 12
   goals met: 2 of 12
5. (lift hoist3 crate2 pallet3 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist3) (on crate2 pallet3)
   added: (lifting hoist3 crate2) (clear pallet3)
   changed: (fuel-cost) from 12 to 13
   goals met: 2 of 12
6. (drop hoist8 crate4 pallet3 distributor0)
   deleted: (lifting hoist8 crate4) (clear pallet3)
   added: (available hoist8) (at crate4 distributor0) (clear crate4) (on crate4 pallet3)
   goals met: 3 of 12
7. (drop hoist3 crate2 crate4 distributor0)
   deleted: (lifting hoist3 crate2) (clear crate4)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 crate4)
   goals met: 4 of 12
8. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 13 to 23
   goals met: 4 of 12
9. (unload hoist4 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist4)
   added: (lifting hoist4 crate7)
   changed: (current_load truck0) from 30 to 0
   goals met: 4 of 12
10. (lift hoist2 crate13 pallet7 depot2)
   deleted: (at crate13 depot2) (clear crate13) (available hoist2) (on crate13 pallet7)
   added: (lifting hoist2 crate13) (clear pallet7)
   changed: (fuel-cost) from 23 to 24
   goals met: 4 of 12
11. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 24 to 34
   goals met: 4 of 12
12. (load hoist2 crate13 truck0 depot2)
   deleted: (lifting hoist2 crate13)
   added: (in crate13 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 49
   goals met: 4 of 12
13. (lift hoist2 crate3 crate1 depot2)
   deleted: (at crate3 depot2) (clear crate3) (available hoist2) (on crate3 crate1)
   added: (lifting hoist2 crate3) (clear crate1)
   changed: (fuel-cost) from 34 to 35
   goals met: 4 of 12
14. (load hoist2 crate3 truck0 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 49 to 62
   goals met: 4 of 12
15. (lift hoist9 crate12 crate10 distributor2)
   deleted: (at crate12 distributor2) (clear crate12) (available hoist9) (on crate12 crate10)
   added: (lifting hoist9 crate12) (clear crate10)
   changed: (fuel-cost) from 35 to 36
   goals met: 4 of 12
16. (lift hoist2 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   changed: (fuel-cost) from 36 to 37
   goals met: 4 of 12
17. (load hoist2 crate1 truck0 depot2)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck0) (available hoist2)
   changed: (current_load truck0) from 62 to 144
   goals met: 4 of 12
18. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 37 to 47
   goals met: 4 of 12
19. (load hoist9 crate12 truck0 distributor2)
   deleted: (lifting hoist9 crate12)
   added: (in crate12 truck0) (available hoist9)
   changed: (current_load truck0) from 144 to 237
   goals met: 4 of 12
20. (unload hoist5 crate1 truck0 distributor2)
   deleted: (in crate1 truck0) (available hoist5)
   added: (lifting hoist5 crate1)
   changed: (current_load truck0) from 237 to 155
   goals met: 4 of 12
21. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 47 to 57
   goals met: 4 of 12
22. (drop hoist5 crate1 crate10 distributor2)
   deleted: (lifting hoist5 crate1) (clear crate10)
   added: (available hoist5) (at crate1 distributor2) (clear crate1) (on crate1 crate10)
   goals met: 5 of 12
23. (drop hoist4 crate7 crate9 distributor1)
   deleted: (lifting hoist4 crate7) (clear crate9)
   added: (available hoist4) (at crate7 distributor1) (clear crate7) (on crate7 crate9)
   goals met: 6 of 12
24. (unload hoist4 crate12 truck0 distributor1)
   deleted: (in crate12 truck0) (available hoist4)
   added: (lifting hoist4 crate12)
   changed: (current_load truck0) from 155 to 62
   goals met: 6 of 12
25. (load hoist4 crate12 truck1 distributor1)
   deleted: (lifting hoist4 crate12)
   added: (in crate12 truck1) (available hoist4)
   changed: (current_load truck1) from 0 to 93
   goals met: 6 of 12
26. (lift hoist4 crate11 crate6 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist4) (on crate11 crate6)
   added: (lifting hoist4 crate11) (clear crate6)
   changed: (fuel-cost) from 57 to 58
   goals met: 6 of 12
27. (drop hoist4 crate11 crate7 distributor1)
   deleted: (lifting hoist4 crate11) (clear crate7)
   added: (available hoist4) (at crate11 distributor1) (clear crate11) (on crate11 crate7)
   goals met: 6 of 12
28. (unload hoist4 crate12 truck1 distributor1)
   deleted: (in crate12 truck1) (available hoist4)
   added: (lifting hoist4 crate12)
   changed: (current_load truck1) from 93 to 0
   goals met: 6 of 12
29. (drop hoist4 crate12 crate11 distributor1)
   deleted: (lifting hoist4 crate12) (clear crate11)
   added: (available hoist4) (at crate12 distributor1) (clear crate12) (on crate12 crate11)
   goals met: 7 of 12
30. (unload hoist4 crate13 truck0 distributor1)
   deleted: (in crate13 truck0) (available hoist4)
   added: (lifting hoist4 crate13)
   changed: (current_load truck0) from 62 to 13
   goals met: 7 of 12
31. (load hoist4 crate13 truck1 distributor1)
   deleted: (lifting hoist4 crate13)
   added: (in crate13 truck1) (available hoist4)
   changed: (current_load truck1) from 0 to 49
   goals met: 7 of 12
32. (lift hoist4 crate6 crate0 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist4) (on crate6 crate0)
   added: (lifting hoist4 crate6) (clear crate0)
   changed: (fuel-cost) from 58 to 59
   goals met: 7 of 12
33. (drop hoist4 crate6 crate12 distributor1)
   deleted: (lifting hoist4 crate6) (clear crate12)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 crate12)
   goals met: 7 of 12
34. (lift hoist4 crate0 pallet4 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist4) (on crate0 pallet4)
   added: (lifting hoist4 crate0) (clear pallet4)
   changed: (fuel-cost) from 59 to 60
   goals met: 7 of 12
35. (load hoist4 crate0 truck1 distributor1)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck1) (available hoist4)
   changed: (current_load truck1) from 49 to 55
   goals met: 7 of 12
36. (lift hoist4 crate6 crate12 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist4) (on crate6 crate12)
   added: (lifting hoist4 crate6) (clear crate12)
   changed: (fuel-cost) from 60 to 61
   goals met: 7 of 12
37. (drop hoist4 crate6 pallet4 distributor1)
   deleted: (lifting hoist4 crate6) (clear pallet4)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 pallet4)
   goals met: 8 of 12
38. (unload hoist4 crate13 truck1 distributor1)
   deleted: (in crate13 truck1) (available hoist4)
   added: (lifting hoist4 crate13)
   changed: (current_load truck1) from 55 to 6
   goals met: 8 of 12
39. (drop hoist4 crate13 crate6 distributor1)
   deleted: (lifting hoist4 crate13) (clear crate6)
   added: (available hoist4) (at crate13 distributor1) (clear crate13) (on crate13 crate6)
   goals met: 9 of 12
40. (lift hoist4 crate12 crate11 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist4) (on crate12 crate11)
   added: (lifting hoist4 crate12) (clear crate11)
   changed: (fuel-cost) from 61 to 62
   goals met: 8 of 12
41. (drop hoist4 crate12 crate13 distributor1)
   deleted: (lifting hoist4 crate12) (clear crate13)
   added: (available hoist4) (at crate12 distributor1) (clear crate12) (on crate12 crate13)
   goals met: 8 of 12
42. (lift hoist4 crate11 crate7 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist4) (on crate11 crate7)
   added: (lifting hoist4 crate11) (clear crate7)
   changed: (fuel-cost) from 62 to 63
   goals met: 8 of 12
43. (drop hoist4 crate11 crate12 distributor1)
   deleted: (lifting hoist4 crate11) (clear crate12)
   added: (available hoist4) (at crate11 distributor1) (clear crate11) (on crate11 crate12)
   goals met: 8 of 12
44. (lift hoist4 crate7 crate9 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 crate9)
   added: (lifting hoist4 crate7) (clear crate9)
   changed: (fuel-cost) from 63 to 64
   goals met: 7 of 12
45. (load hoist4 crate7 truck1 distributor1)
   deleted: (lifting hoist4 crate7)
   added: (in crate7 truck1) (available hoist4)
   changed: (current_load truck1) from 6 to 36
   goals met: 7 of 12
46. (lift hoist4 crate9 crate8 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 crate8)
   added: (lifting hoist4 crate9) (clear crate8)
   changed: (fuel-cost) from 64 to 65
   goals met: 7 of 12
47. (load hoist4 crate9 truck1 distributor1)
   deleted: (lifting hoist4 crate9)
   added: (in crate9 truck1) (available hoist4)
   changed: (current_load truck1) from 36 to 92
   goals met: 7 of 12
48. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 65 to 75
   goals met: 7 of 12
49. (unload hoist0 crate9 truck1 depot0)
   deleted: (in crate9 truck1) (available hoist0)
   added: (lifting hoist0 crate9)
   changed: (current_load truck1) from 92 to 36
   goals met: 7 of 12
50. (drop hoist0 crate9 pallet0 depot0)
   deleted: (lifting hoist0 crate9) (clear pallet0)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 pallet0)
   goals met: 8 of 12
51. (unload hoist10 crate7 truck1 depot0)
   deleted: (in crate7 truck1) (available hoist10)
   added: (lifting hoist10 crate7)
   changed: (current_load truck1) from 36 to 6
   goals met: 8 of 12
52. (drop hoist10 crate7 crate9 depot0)
   deleted: (lifting hoist10 crate7) (clear crate9)
   added: (available hoist10) (at crate7 depot0) (clear crate7) (on crate7 crate9)
   goals met: 9 of 12
53. (lift hoist4 crate8 pallet6 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist4) (on crate8 pallet6)
   added: (lifting hoist4 crate8) (clear pallet6)
   changed: (fuel-cost) from 75 to 76
   goals met: 9 of 12
54. (load hoist4 crate8 truck0 distributor1)
   deleted: (lifting hoist4 crate8)
   added: (in crate8 truck0) (available hoist4)
   changed: (current_load truck0) from 13 to 112
   goals met: 9 of 12
55. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 76 to 86
   goals met: 9 of 12
56. (lift hoist4 crate11 crate12 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist4) (on crate11 crate12)
   added: (lifting hoist4 crate11) (clear crate12)
   changed: (fuel-cost) from 86 to 87
   goals met: 9 of 12
57. (drop hoist4 crate11 pallet6 distributor1)
   deleted: (lifting hoist4 crate11) (clear pallet6)
   added: (available hoist4) (at crate11 distributor1) (clear crate11) (on crate11 pallet6)
   goals met: 10 of 12
58. (unload hoist2 crate8 truck0 depot2)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 112 to 13
   goals met: 10 of 12
59. (lift hoist4 crate12 crate13 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist4) (on crate12 crate13)
   added: (lifting hoist4 crate12) (clear crate13)
   changed: (fuel-cost) from 87 to 88
   goals met: 10 of 12
60. (drop hoist2 crate8 pallet2 depot2)
   deleted: (lifting hoist2 crate8) (clear pallet2)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 pallet2)
   goals met: 11 of 12
61. (drop hoist4 crate12 crate11 distributor1)
   deleted: (lifting hoist4 crate12) (clear crate11)
   added: (available hoist4) (at crate12 distributor1) (clear crate12) (on crate12 crate11)
   goals met: 12 of 12
